{"dark": ["A man in a bar sees a friend at a table, drinking by himself. \nApproaching the friend he comments, \"You look terrible. What's the problem?\" \n\"My mother died in June,\" he said, \"and left me $10,000.\" \n\"Gee, that's tough,\" he replied. \n\"Then in July,\" the friend continued, \"My father died, leaving me $50,000.\" \n\"Wow. Two parents gone in two months. No wonder you're depressed.\" \n\"And last month my aunt died, and left me $15,000.\" \n\"Three close family members lost in three months? How sad.\" \n\"Then this month,\" continued, the friend, \"nothing!\"", "Eat right. Stay fit. Die anyway.", "The KKK isn't really that racist. I went to one of their meetings and there were a lot of black people hanging around.", "Dark humor is like food, not everyone gets it", "Chuck Norris died years ago than reapears just to afraid to tell him.", "If Microsoft Built Cars\n1. Every time they repainted the lines on the road you would have to buy a new car.\n2. Occasionally your car would die on the freeway for no reason, and you would just accept this, restart and drive on.\n3. Occasionally, executing a maneuver would cause your car to stop and fail and you would have to re-install the engine. For some strange reason, you would accept this too.\n4. You could only have one person in the car at a time, unless you bought \"Car95\" or \"CarNT\". But, then you would have to buy more seats.\n5. Macintosh would make a car that was powered by the sun, was reliable, five times as fast, twice as easy to drive - but would only run on 5 percent of the roads.\n6. The Macintosh car owners would get expensive Microsoft upgrades to their cars, which would make their cars run much slower.\n7. The oil, gas and.", "I'm tired of my grandma! Whenever someone's wedding comes up, she says, \"Next is your turn.\" So I've decided when someone dies I'm going to say, \"Next is your turn, grandma.\"", "The grass is always greener on the other side, unless of course chuck norris has been there. In that case, it is probably soaked in blood and tears.", "So Ole was hiking in the mountains of Norway and he slips on a wet rock and he falls over the edge of a five-hundred-foot cliff, and he falls twenty feet and he grabs hold of a bush that's growing out of a rock. And there he is, he's hanging looking down at this deep fjord down below him certain death and his hands start to perspire and he starts to slip on this bush and he yells out, \"Is anybody up there?\"\nAnd he heard a deep voice rings out in the fjord, \"I'm here, Ole. It's the Lord, Ole. Have faith. Let go of that bush and I will save you.\" \nOle looked down, and he looked up, and he says, \"Is anyone else up there?\"", "If I wanted to kill myself I'd climb your ego and jump to your IQ.", "White people don't shoot each other in the streets as black people do. They do it in schools because they have class.", "A man escapes from prison where he has been for 15 years. He breaks into a house to look for money and guns, and finds a young couple in bed. He orders the guy out of bed and ties him to a chair. He ties the girl to the bed and he gets on top of her, kisses her neck, and then gets up and goes into the bathroom. While he's in there, the husband tells his wife, \"Listen, this guy is an escaped convict, look at his clothes! He probably spent lots of time in jail and hasn't seen a woman in years. I saw how he kissed your neck. If he wants sex, don't resist, don't complain, do whatever he tells you. Satisfy him no matter how much he nauseates you. This guy is probably very dangerous. If he gets angry, he'll kill us. Be strong, honey. I love you.\" His wife responds, \"He wasn't kissing my neck. He was whispering in my ear. He told me he was gay, thought you were cute, and asked me if we had any Vaseline. I told him it was in the bathroom. Be strong honey. I love you, too!\"", "How do I know that my youth is all spent?\nWell, my get up and go has got up and went.\nBut in spite of it all I am able to grin\nwhen I recall where my get up has been.\nOld age is golden-so I've heard it said-\nbut sometimes I wonder when I get into bed,\nwith my ears in a drawer and my teeth in a cup,\nmy eyes on the table until I wake up.\nEre sleep dims my eyes I say to myself,\n\"Is there anything else I should lay on the shelf?\"\nAnd I'm happy to say as I close my door,\nmy friends are the same, perhaps even more.\nWhen I was young, my slippers were red,\nI could pick up my heels right over my head.\nWhen I grew older, my slippers were blue,\nbut still I could dance the whole night through.\nBut now I am old, my slippers are black,\nI walk to the store and puff my way back.\nThe reason I know my youth is all spent,\nmy get up and go has got up and went.\nBut I really don't mind when I think, with a grin,\nof all the grand places my get up has been.\nSince I have retired from life's competition,\nI accommodate myself with complete repetition.\nI get up each morning, and dust off my wits,\npick up my paper and read the \"obits\".\nIf my name is missing, I know I'm not dead,\nso I eat a good breakfast and go back to bed.", "Once upon a time a Scotsman, an Englishman and an Irishman were captured by the Red Indians on a prospecting trip in North America. They been tied up against their respective totem poles for a day when the Chief walked up to the Englishman, pinched the skin of his upper arm and said, \"Hmmm, heap good skin, nice and thick. Will make heap good canoe. You have a last request?\"\"That case of gin I had when your boys caught me. I'd like that\", says the Englishman. He's provided with his gin and is taken off to a teepee for his final night. The Englishman drinks two bottles of gin.In the morning the Indians dispatch him, skin him and make him into a canoe. The canoe lasts a couple of days when it tears on a rock. Next day the Chief walks up to the Scotsman, pinches the skin at the top of his arm and says, \"Hmmm, heap, heap good skin, very, very thick. Will make heap, heap good canoe. You have a last request?\"Ah'll huv ma whisky back\", says the Scotsman. He's provided with his whisky and taken off to a teepee for his final night. The Scotsman drinks three bottles of whisky. He's already dead when the Indians come to collect him the next morning. They skin him and make him into a canoe. The canoe lasts a week before it tears on a rock. Next day the Chief walks up to the Irishman, pinches the skin at the top of his arm and says, \"Hmmm, heap, heap, heap, heap good skin, very, very, very, very thick. Will make heap, heap, heap, heap good canoe. You have a last request?\"I'd loike a fork.\", says the Irishman.The Chief gives him a funny look but gives him the fork. The Irishman takes the fork, stabs himself repeatedly shouting, \"Yer no makin' any bloody canoe outta me!\"", "Two elderly women were out driving in a large car-both could barely see over the dashboard. As they were cruising along they came to an intersection. The stoplight was red but they just went on through. The woman in the passenger seat thought to herself \"I must be losing it, I could have sworn we just went through a red light.\"\nAfter a few more minutes they came to another intersection and the light was red again and again they went right though. This time the woman in the passenger seat was almost sure that the light had been red but was really concerned that she was losing it. She was getting nervous and decided to pay very close attention to the road and the next intersection to see what was going on.\nAt the next intersection, sure enough, the light was definitely red and they went right through and she turned to the other woman and said, \"Mildred! Did you know we just ran through three red lights in a row! You could have killed us!\"\nMildred turned to her and said, \"Oh, am I driving?\"", "A long time ago, Britain and France were at war.\nDuring one battle, The French captured an English major.\nTaking the major to their headquarters, the French general began to question him.\nThe French general asked, \"Why do you English officers all wear red coats? Don't you know the red material makes you easier targets for us to shoot at?\" \nIn his bland English way, the major informed the general that the reason English officers wear red coats is so that if they are shot, the blood won't show and the men they are leading won't panic.\nAnd that is why from that day to now, all French Army officers wear brown pants.", "Why is there so much blood in my alcohol system?", "Short summary of every Jewish\nholiday\nThey tried to kill us.\nWe won.\nLet's eat.", "During a bank robbery, the thief's mask slipped off. He fixed it and asked a hostage, \"Did you see my face?\" The hostage had, so the thief killed him. He asked the next hostage, same result. After he asked a third hostage, the guy responded, \"No, but my wife did.\"", "It is legal to gather and consume road kill.", "An executive was interviewing a young woman for a position in his company. He wanted to learn something about her personality, so he asked, \"if you could have a conversation with anyone, living or dead, who would it be?\"\nShe quickly responded, \"The living one.\"", "What do Ted Bundy and the Space Shuttle Columbia have in common? They both left bodies in four states.", "A small tourist hotel was all a buzz about an afternoon wedding where the groom was 95 and the bride was 23. The groom looked pretty feeble and the feeling was that the wedding night might kill him, because his bride was a healthy, vivacious young woman. \n But lo and behold, the next morning, the bride came down the main staircase slowly, step by step, hanging onto the banister for dear life. She finally managed to get to the counter of the little shop in the hotel. \n The clerk looked really concerned, \"Whatever happened to you, honey? You look like you've been wrestling an alligator!\" \n The bride groaned, hung on to the counter and managed to speak, \"Ohhh God! He told me he'd been saving up for 75 years... \n I thought he meant his money!\"", "During a discussion at Sunday school, a nun asks the children what they think God takes you by when you die. A kid responds, \"I think God takes you by your feet, because once I walked into my parents room and my mom's feet were in the air and she was screaming, \"Oh God, I'm coming!\"", "Starting his new job at the zoo, the eager young zoo keeper asked the Head keeper what he should do for his first task. \"Go and clean out the aquarium\" he was told. \nArriving at the aquarium, he discovered that all the fish were dead. He rushed back to the head keeper and asked what he should do. \"Throw them to the lions\" said the head keeper, \"the lions will eat anything\". So the young keeper returned to the aquarium, picked up all the dead fish and threw them into the lion's cage. That done, he returned and asked what he should do now. \nHe was instructed to go and clean out the ape house. Off he went and started cleaning. He was shocked to discover dead chimpanzees in the cage, and rushed back for instructions. \"Dont worry\" said the head keeper, \"just throw them to the lions, the lions will eat anything\". So the young man returns to the ape house and throws the dead animals into the lions cage.\nReturning again for instructions, he is told to go along and help clean up the insect house. Busy cleaning out one off the exotic hives, he notices that all the bees have died. \n\"I know what to do\", he thinks to himself \"I'll throw them all to the lions, as the lions will eat anything\", whereupon he brushes them all up and throws them into the lion cage. The next day, the zoo obtains a new lioness. The lioness is walking around the new cage for the first time, and starts asking the other lions what things are like here. \"Hows the accommodation?\", she asks. \"Fine\" comes the reply from one lion. \"And whats the food like?\" she asks.\n\"Not bad\" replies another, \"yesterday, we had fish, chimps and mushy bees\".", "What's the difference between an Italian mother and a Jewish mother?\nAn Italian mother says, \"If you don't eat it, I'll kill you.\"\nA Jewish mother says, \"If you don't eat it, I'll kill myself.\"", "Q: How are a lawyer and a prostitute\n different?\n A: The prostitute stops fucking you after you're dead.", "A man went to the All Stars game with two front row seat tickets. He sat down and then another man asked him if the other chair was taken. The man said \" no, it was supposed to be for my wife.\" The other man said \" well where is she? And he said \"she died two days ago\" from a stroke. The other man said \"well thats unfortunate, I'm so sorry for you. But should'nt you give this seat to another family members?\" And the man said, \"no they're all at the funeral\"", "A sailor and a priest were playing golf. The\n sailor took his first shot missed and said, \"Fuck, I\n missed.\" Surprised, the priest replied, \"Don't use that\n kind of language or god will punish you.\" The sailor took aim\n and hit his shot second shot. Again he missed and under his breath\n the said, \"I fuck'n missed again.\" The priest overheard\n and replied, \"My son, please don't use that language or god\n will punish you.\" The sailor took his third shot and once again\n he couldn't help mutter, \"Oh fuck!\" The priest said,\n \"That's it god will certainly punish you.\" Suddenly a\n bolt of lightning came down and killed the priest. In the distance a\n deep voice said, \"FUCK, I Missed\".", "Jokes about anti-vaxxer parents never get old. Just like their kids.", "Jokes about anti-vaxxer parents never get old. Just like their kids.", "This seemed to satisfy the old priest and \n things went well, until the priest died at a ripe old age. About a \n week after the new priest arrived, he visited the Mayor of the town \n and seemed very concerned. The priest said, \"you have to do \n something about the sidewalks in town. When people come into the \n confessional, they keep talking about having fallen.\" The Mayor \n started to laugh, realizing that no-one had told the new priest \n about the code word. \n \n Before the mayor could explain, the priest shook an accusing finger \n at the mayor and said, \"I don't know what you're laughing about, \n Your wife fell three times this week.\"", "A guy took his girl friend to her first Longhorn football game. They had great seats right behind their team's bench. After the game, he asked her how she liked the experience. \"Oh, I really liked it,\" she replied, \n\"Especially the tight pants and all the big muscles, but I just couldn't understand why they were killing each other over 25 cents.\"\nDumbfounded, her date asked, \"What do you mean?\"\n\"Well, I saw them flip a coin and one team got it and then for the rest of the game, all they kept screaming was: get the quarterback. Get the quarterback! It's only 25 cents!", "Two Irishmen are sitting in a bar. Mick's looking particularly sad \nand Patrick asks him what the matter is. mick says, \"well, I knew that \nmy grandfather had died in the war, but I've just found out that he \nactually died in the auschwitz concentration camp.\"\nPatrick says, \"that's terrible, did he go to the gas chamber?\" and Mick\nreplies, \"no, he fell out of the machine gun tower.\"", "A man kills a deer and takes it home to cook for dinner. Both he and his wife decide that they won't tell the kids what kind of meat it is, but will give them a clue and let them guess. The dad said, \"Well it's what Mommy calls me sometimes.\" The little girl screamed to her brother, \"Don't eat it. Its an asshole!", "A farmer's last rooster dies leaving his 200 hens unable to produce chicks. He logs onto roosters.com, finds a highly-touted and high-priced specimen, clicks \"order\" and the next day, FedEx delivers a rather ordinary looking rooster named Randy.\nBefore releasing Randy to the chicken coop, the farmer tells him, \"You were one danged expensive rooster and I've got a couple hundred chickens here for you to service, so take your time and do a good job.\"\nRandy acts as if he understands, but as soon as he is released he attacks the hens with a vengeance, working his way through the entire flock, not just once, but three times without pause!\nThe farmer can't believe his eyes. Then Randy runs out of the hen house, sees a flock of geese down by the lake and services all the geese. The farmer is distraught, worrying that his expensive rooster won't make it through the night.\nSure enough, the next morning when the farmer wakes, he sees Randy lying dead, buzzards circling overhead. As the farmer bends over to retrieve his costly loss, he shakes his head and says, \"Damn it, Randy! Didn't I tell you to pace yourself?\"\nRandy opens one eye, looks at the circling buzzards and says, \"Shhh. They're getting closer.\"", "How did you do it?\nYoung David asked his rich grandfather,\nPaul, how he had made his money. Paul said, \"Well, David, it was 1955,\nand I was down to my last five pence. I went to the local market and invested\nthat five pence in a large apple. I spent the entire day polishing the\napple and, at the end of the day, I sold the apple for ten pence.\"\n\"The next morning, I invested the ten pence\nin two large apples. I spent the entire day polishing them and I sold them\nat 5pm for twenty pence. I continued this system for a month. Then Grandma’s\nfather died and left us two million pounds.\"", "An Irishman moves into a tiny hamlet in County Kerry, walks into the pub and promptly orders three beers.\nThe bartender raises his eyebrows, but serves the man three beers, which he drinks quietly at a table, alone.\nAn hour later, the man has finished the three beers and orders three more.\nThis happens yet again.\nThe next evening the man again orders and drinks three beers at a time, several times. Soon the entire town is whispering about the Man Who Orders Three Beers.\nFinally, a week later, the bartender broaches the subject on behalf of the town. \"I don't mean to pry, but folks around here are wondering why you always order three beers?\"\n'Tis odd, isn't it?\" the man replies, \"You see, I have two brothers, and one went to America, and the other to Australia. We promised each other that we would always order an extra two beers whenever we drank as a way of keeping up the family bond.\"\nThe bartender and the whole town was pleased with this answer, and soon the Man Who Orders Three Beers became a local celebrity and source of pride to the hamlet, even to the extent that out-of-towners would come to watch him drink.\nThen, one day, the man comes in and orders only two beers. The bartender pours them with a heavy heart. This continues for the rest of the evening - he orders only two beers. The word flies around town. Prayers are offered for the soul of one of the brothers.\nThe next day, the bartender says to the man, \"Folks around here, me first of all, want to offer condolences to you for the death of your brother. You know-the two beers and all...\"\nThe man ponders this for a moment, then replies, \"You'll be happy to hear that my two brothers are alive and well... It's just that I, myself, have decided to give up drinking for Lent.\"", "Patient: \"What are the chances of my recovering doctor?\"\nDoctor: \"One hundred percent. Medical records show that nine out of ten\npeople die of the disease you have. \"Yours is the tenth case I've treated;\nthe others all died.\"", "How does a black woman fight crime? She has an abortion.", "Hey girl are you a school? Because I want to shoot some kids up inside of you.", "How did the blonde die drinking milk? The cow fell on her.", "A blonde decides to learn and try horse back riding unassisted without prior experience or lessons. She mounts the horse with great effort, and the tall, shiny horse springs into motion.\nIt gallops along at a steady and rhythmic pace, but the blonde begins to slip from the saddle. Out of shear terror, she grabs for the horse's mane but cannot seem to get a firm grip. She tries to throw her arms around the horse's neck, but she slides down the side of the horse anyway. The horse gallops along, seemingly oblivious to its slipping rider.\nFinally, giving up her frail grip, she leaps away from the horse to try and throw herself to safety.\nUnfortunately, her foot has become entangled in the stirrup. She is now at the mercy of the horse's pounding hooves as her head is struck against the ground again and again. As her head is battered against the ground, she is mere moments away from unconsciousness or even death when Frank, the Wal-Mart manager runs out to shut the horse off.", "I hate double standards. Burn a body at a crematorium, you're \"being a respectful friend.\" Do it at home and you're \"destroying evidence.\"", "Q: What's the definition of a bachelor pad?\nA: All the house plants are dead, but there's something growing in the refrigerator.", "How do you kill a blonde? Put a scratch-and-sniff at the bottom of a pool.", "Two guys are standing in line to enter heaven. One turned around and asked the other how he died. \"I froze to death. How about you?\" \"I had a heart attack.\" \"How did that happen?\" \"Well, I suspected my wife was cheating on me. So after work I went straight home. I ran upstairs to find my wife sleeping by herself. Then I ran back downstairs and looked in all the hiding spots. When I was running back up the stairs, I had a heart attack.\" \"That's ironic.\" \"Why?\" \"If you would've looked in the fridge, we'd both be alive.\"", "SICK DAYS:\nWe will no longer accept a doctor statement as proof of sickness. If you are able to go to the doctor, you are able to come to work. \nSURGERY:\nOperations are now banned. As long as you are an employee here, you need all your organs. You should not consider removing anything. We hired you intact. To have something removed constitutes a breach of employment. \nPERSONAL DAYS:\nEach employee will receive 104 personal days a year. They are called Saturday and Sunday. \nVACATION DAYS:\nAll employees will take their vacation at the same time every year. The vacation days are as follows: Jan. 1, July 4 & Dec. 25 \nBEREAVEMENT LEAVE:\nThis is no excuse for missing work. There is nothing you can do for dead friends, relatives or coworkers. Every effort should be made to have non-employees attend to the arrangements. I.", "Once upon a time there lived three men: a doctor, a chemist, and an engineer. For some reason all three offended the king and were sentenced to die on the same day.The day of the execution arrived, and the doctor was led up to the guillotine.As he strapped the doctor to the guillotine, the executioner asked, \"Head up or head down?\"\"Head up,\" said the doctor.\"Blindfold or no blindfold?\"\"No blindfold.\"So the executioner raised the axe, and z-z-z-z-ing! Down came the blade--and stopped barely an inch above the doctor's neck. Well, the law stated that if an execution didn't succeed the first time the prisoner had to be released, so the doctor was set free.Then the chemist was led up to the guillotine.\"Head up or head down?\" said the executioner.\"Head up.\"\"Blindfold or no blindfold?\"\"No blindfold.\"So the executioner raised his axe, and z-z-z-z-ing! Down came the blade--and stopped an inch above the chemist's neck. Well, the law stated that if the execution didn't succeed the first time the prisoner had to be released, so the chemist was set free.Finally the engineer was led up to the guillotine.\"Head up or head down?\"\"Head up.\"\"Blindfold or no blindfold?\"\"No blindfold.\"So the executioner raised his axe, but before he could cut the rope, the engineer yelled out:\"WAIT! I see what the problem is!\".", "They say that married men live the longest. It's ironic, since they're the ones most willing to die.", "This is what cats have scheduled around the clock! You indoor cat owners can agree with me!\n12:00 AM: The cat gets hungry hops on to nearest human attempts to wake human up to feed the cat!\n1:00 AM: After human feeds the cat at midnight, the cat gets a surge of energy and has a sudden need to play! Cat then jumps up and down on human's chest as a use for entertainment. \n3:06 AM: After the human throws the cat off the bed, the cat jumps back up on the bed and finds the human's toes as a new toy.\n3:10 AM: After the human kicks the cat off the bed, the cat gets angry and storms out of the room.\n4:00 AM: Human goes to the bathroom. Cats find this a great opportunity to show affection for human. When human returns to the bedroom he finds the cat totally stretched out in the right across the dead center of the bed. After human throws cat into basement the cat feels upset and hurt. Cat claws and meows at the door in order to get the human.", "What did the boy with no arms get for Christmas? I don't know, he hasn't opened it yet.", "A farmer's last rooster dies leaving his 200 hens unable to produce chicks. He logs onto roosters.com, finds a highly-touted and high-priced specimen, clicks \"order\" and the next day, FedEx delivers a rather ordinary looking rooster named Randy.\nBefore releasing Randy to the chicken coop, the farmer tells him, \"You were one danged expensive rooster and I've got a couple hundred chickens here for you to service, so take your time and do a good job.\"\nRandy acts as if he understands, but as soon as he is released he attacks the hens with a vengeance, working his way through the entire flock, not just once, but three times without pause!\nThe farmer can't believe his eyes. Then Randy runs out of the hen house, sees a flock of geese down by the lake and services all the geese. The farmer is distraught, worrying that his expensive rooster won't make it through the night.\nSure enough, the next morning when the farmer wakes, he sees Randy lying dead, buzzards circling overhead. As the farmer bends over to retrieve his costly loss, he shakes his head and says, \"Damn it, Randy! Didn't I tell you to pace yourself?\"\nRandy opens one eye, looks at the circling buzzards and says, \"Shhh. They're getting closer.\"", "A blonde, a fat brunette, and a skinny redhead find a magic mirror. If you lie to the mirror you die. The redhead says, \"I look fat,\" and dies. The brunette says, \" I look skinny,\" and dies. The blonde says, \"I think...\" and dies.", "A sailor and a priest were playing golf. The\n sailor took his first shot missed and said, \"Fuck, I\n missed.\" Surprised, the priest replied, \"Don't use that\n kind of language or god will punish you.\" The sailor took aim\n and hit his shot second shot. Again he missed and under his breath\n the said, \"I fuck'n missed again.\" The priest overheard\n and replied, \"My son, please don't use that language or god\n will punish you.\" The sailor took his third shot and once again\n he couldn't help mutter, \"Oh fuck¦\" The priest said,\n \"That's it god will certainly punish you.\" Suddenly a\n bolt of lightning came down and killed the priest. In the distance a\n deep voice said, \"FUCK, I Missed\".", "A Texan farmer goes to Australia for a vacation. There he meets an Aussie farmer and gets talking. The Aussie shows off his big wheat field and the Texan says, \"Oh! We have wheat fields that are at least twice as large\".Then they walk around the ranch a little, and the Aussie shows off his herd of cattle. The Texan immediately says, \" We have longhorns that are at least twice as large as your cows\".The conversation has, meanwhile, almost died when the Texan sees a herd of kangaroos hopping through the field. He asked, \"And what are those\"?The Aussie replies with an incredulous look, \"Don't you have any grasshoppers in Texas\"?", "An elderly couple, still very loving after all these years, is shocked when the woman's doctor says she has a heart condition that could kill her at any time. She is to avoid stress, eat right, and never, ever have sex again--the strain would be too much.\nThe couple reluctantly try to live by these rules. Both get really horny over time, however, and the husband decides he'd better sleep downstairs on the couch to guard against temptation.\nThis works for a few weeks, until late one night when they meet each other on the stairs--she's coming downstairs, he's heading up.\n\"Honey, I have a confession to make,\" the woman says, her voice quavering. \"I was about to commit suicide.\"\n\"I'm glad to hear it, sweetie,\" the man says, \"Because I was just coming upstairs to kill you!\"", "What do lawyers do after they die?\nThey lie still.", "Yo momma's so skanky that the reason you're called a Half-Blood Prince is because she has no idea who your father is!", "Little Billy came home from school to see the family's pet rooster dead in the front yard. Rigor mortis had set in and it was flat on its back with its legs in the air. When his Dad came home, Billy mentioned, \"Dad, our rooster is dead and his legs are sticking in the air. Why are his legs like that?\" His father, thinking quickly, said, \"Son, that's so God can reach down from the clouds and lift the rooster straight up to heaven.\" \"Gee Dad, that's great,\" said little Billy. A few days later, when Dad came home from work, Billy rushed out to meet him yelling, \"Dad! Dad, we almost lost Mom today!\" \"What do you mean?\" asked his father. \"Well Dad, I got home from school early today and went up to your bedroom and there was Mom, flat on her back with her legs in the air, screaming, 'Jesus, I'm coming! I'm coming!' If it hadn't of been for Uncle George holding her down, we'd have lost her for sure!\"", "During a visit to a military medical clinic, I was sent to the lab to have blood drawn. The technician there was friendly and mentioned that his mood improved every day because he was due to leave the service in two months.\nAs he applied the tourniquet on my arm, he told me that taking the blood wouldn't hurt much. Then, noticing my Air Force T-shirt he asked me what my husband did.\nWhen I replied that he was a recruiter, the technician smiled slyly and said, \"This might hurt a little more than I thought.\"", "If Microsoft were Jewish:\n1. Your PC would shut down automatically\non Friday evenings.\n2. Your \"Start\" button would be replaced\nwith a \"Let's go. I'm not getting any younger.\" button.\n3. RETRY would be replaced with \"You vant\nI should try again?\"\n4. When disconnecting external devices\nfrom your PC, instructions would say \"Remove from your PC's tuchis the\ncable \".\n5. Your CD player would be labelled \"Nu,\nso play my music already.\".\n6. You would hear \"Hava Nagila\" during\nstartup.\n7. SCANDISK prompts you with, \"You vant\nI should fix?\" message.\n8. When your PC is mult-tasking, you would\noccasionally hear an \"Oy Gevult.\"\n9. Manischewitz would advertise that its \n\"monitor cleaning solution\" gets rid of the \"schmutz\" on your screen.\n10. After 20 minutes in an idle state, \nyour PC would go \"Schloffen.\"\n11. All computer viruses would be cured\nwith chicken soup.\n12. After your computer dies, you would\nhave to dispose of it within 24 hours.\n13. Internet Explorer would have a spinning\n\"Star of David\" in the upper right corner.\n14. A screen saver for channukah will\nbe \"Flying Draidles\".\n15. High capacity DVB's (digital video\nbagels) would supercede CD-ROM's.", "A famous mathematician was to give a keynote speech at a conference. Asked for an advance summary, he said he would present a proof of Fermat's Last Theorem -- but they should keep it under their hats. When he arrived, though, he spoke on a much more prosaic topic. Afterwards the conference organizers asked why he said he'd talk about the theorem and then didn't. He replied this was his standard practice, just in case he was killed on the way to the conference.", "Dear Bank Manager,I am writing to thank you for bouncing the check with which I endeavoured to pay my plumber last month. By my calculations some three nanoseconds must have elapsed between his presenting the check, and the arrival in my account of the funds needed to honour it. I refer, of course, to the automatic monthly deposit of my entire salary, an arrangement which, I admit, has only been inplace for eight years.You are to be commended for seizing that brief window of opportunity, and also for debiting my account with $50 by way of penalty for the inconvenience I caused to your bank. My thankfulness springs from the manner in which this incident has caused me to re-think my errant financial ways. You have set me on the path of fiscal righteousness.No more will our relationship be blighted by these unpleasant incidents, for I am restructuring my affairs in 2005, taking as my model the procedures, attitudes and conduct of your very bank. I can think of no greater compliment, and I know you will be excited and proud to hear it.To this end, please be advised about the following changes:First, I have noticed that whereas I personally attend to your telephone calls and letters, when I try to contact you I am confronted by the impersonal, ever-changing, pre-recorded, faceless entity which your bank has become. From now on I, like you, choose only to deal with a flesh and blood person.My mortgage and loan repayments will, therefore and hereafter, no longer be automatic, but will arrive at your bank, by cheque, addressed personally and confidentially to an employee of your branch, whom you must nominate. You will be aware that it is an offence under the Postal Act for any other person to open suchan envelope.Please find attached an Application Contact Status which I require our chosen employee to complete. I am sorry it runs to eight pages, but in order that I know as much about him or her as your bank knows about me, there is no alternative. Please note that all copies of his or her medical history must be countersigned by a Justice of the Peace, and that the mandatory details of his/her financial situation must be accompanied by documented proof.In due course I will issue your employee with a PIN number which he/she must quote in all dealings with me. I regret that it cannot be shorter than 28 digits but, again, I have modelled it on the number of button presses required to access my account balance on your phone bank service. As they say, imitation is the sincerest form of flattery.Let me level the playing field even further by introducing you to my new telephone system, which you will notice, is very much like yours. My authorised contact at your bank, the only person with whom I willhave any dealings, may call me at any time and will be answered by an automated voice.By pressing Buttons on the phone, he/she will be guided thorough an extensive set of menus:1. To make an appointment to see me2. To query a missing repayment3. To make a general complaint or inquiry4. To transfer the call to my living room in case I am there; Extension of living room to be communicated at the time the call is received.5. To transfer the call to my bedroom in case I am still sleeping. Extension of bedroom to be communicated at the time the call is received.6. To transfer the call to my toilet in case I am attending to nature. Extension of toilet to be communicated at the time the call is received.7. To transfer the call to my mobile phone in case I am not at home.8. To leave a message on my computer. To leave a message a password to access my computer is required. Password will be communicated at a later date to the contact.9. To return to the main menu and listen carefully to options 1 through 8. The contact will then be put on hold, pending the attention of my automated answeringservice. While this may on occasion involve a lengthy wait, uplifting music will play for the duration. This month I've chosen a refrain from The Best Of Woody Guthrie:\"Oh, the banks are made of marble With a guard at every door And the vaults are filled with silver That the miners sweated for\"After twenty minutes of that, our mutual contact will probably know it by heart. On a more serious note, we come to the matter of cost.As your bank has often pointed out, the ongoing drive for greater efficiency comes at a cost. A cost which you have always been quick to pass on to me. Let me repay your kindness by passing some costs back.First, there is the matter of advertising material you send me. This I will read for a fee of $20 per page. Inquiries from your nominated contact will be billed at $5 per minute of my time spent in response.Any debits to my account, as, for example, in the matter of the penalty for the dishonoured cheque, will be passed back to you.My new phone service runs at 75 cents a minute , so you would be well advised to keep your inquiries brief and to the point.Regrettably, but again following your example, I must also levy an establishment fee to cover the setting up of this new arrangement.May I wish you a happy, if ever-so-slightly less prosperous, New Year.Your humble client.", "A man awoke one evening to discover prowlers in his storage shed. He immediately called 911, gave his address, to report the prowlers and possible burglary. The operator at the other end said \"Are they in your house?\" He said they were not, only in his storage shed in back of the house. The operator said there were no cars available at that time. He thanked the operator, hung up the phone and counted to 30 and called again. \"I just called you about prowlers in my storage shed. Well you do not have to worry, as I just shot them all dead!\" Within seconds there were 3 police cars, an ambulance and fire engine at the scene. After capturing the prowlers red-handed, the policeman asked the caller, \"I thought you said you had shot them all!\" The man answered, \"I thought you said there were no police available!\"", "Maria is a devout Catholic: She gets married and has 17 children. Soon after the last child is born her husband dies.\nA few weeks later she remarries and over the following years has another 22 children with her second husband.\nAfter the last child is born her second husband also dies.\nWithin a month Maria is engaged to be married a third time. Unfortunately she becomes very ill and dies.\nAt her wake, the priest looks tenderly at Maria as she lies in her coffin, looks up to the heavens and says,\n\"At least, they're finally together.\"\nA man standing next to the priest asks, \"Excuse me, Father, but do you mean Maria and her first husband, or Maria and her second husband?\"\nThe priest says, \"I mean her legs.\"", "Arthur Davidson, died and went to heaven.\nAt the gates, St. Peter told Arthur, \"Since you've been such a good man and your motorcycles have changed the world, your reward is, you can hang out with anyone you want in Heaven.\"\nArthur thought about it for a minute and then said, \"I want to hang out with God.\"\nSt. Peter took Arthur to the Throne Room and introduced him to God.\nGod recognized Arthur and commented, \"Okay, so you were the one who invented the Harley Davidson motorcycle?\"\nArthur said, \"Yep, that's me.\"\nGod said, \"Well, what's the big deal in inventing something that's pretty unstable, makes noise and pollution and can't run without a road?\"\nArthur was apparently embarrassed, but finally he said, \"Excuse me, but aren't You the inventor of woman?\"\nGod said, \"Yes.\"\n\"Well,\" said Arthur, \"professional to professional, you have some major design flaws in your invention:\n1. There's too much inconsistency in the front-end protrusions;\n2. It chatters constantly at high speeds;\n3. Most of the rear ends are too soft and wobble too much;\n4. The intake is placed way too close to the exhaust;\n5. And the maintenance costs are enormous!\"\n\"Hmmm, you have some good points there,\" replied God, \"hold on.\" God went to His Celestial super computer, typed in a few words and waited for the results. The computer printed out a slip of paper and God read it.\n\"Well, it may be true that my invention is flawed,\" God said to Arthur, \"but according to these numbers, more men are riding my invention than yours.\"", "In 1945, Adolf Hitler was really kicked to death by a five year old Chuck Norris.", "Q: Why were there bullet holes in the mirror?\nA: A blonde tried killing herself.", "It seems the US Federal Aviation Administration has a unique device for testing the strength of windshields on airplanes. The device is a gun that launches a dead chicken at a plane's windshield at approximately the speed the plane flies.The theory is that if the windshield doesn't crack from the carcass impact, it'll survive a real collision with a bird during flight. It seems the British were very interested in this and wanted to test a windshield on a brand new, speedy locomotive they're developing.They borrowed the FAA's chicken launcher, loaded the chicken and fired. The ballistic chicken shattered the windshield, went through the engineer's chair, broke an instrument panel and embedded itself in the back wall of the engine cab. The British were stunned and asked the FAA to recheck the test to see if everything was done correctly.The FAA reviewed the test thoroughly and had one recommendation: \"Use a thawed chicken.\"", "What is the vampire's favorite slogan? \nPlease Give Blood Generously.", "TOP TEN BAD THINGS ABOUT HAVING A SUMMER TIME SHARE WITH DARTH VADER...10. Claims those long-distance calls to the Death Star aren't his. 9. Uses Jedi powers to shake up your root beer right before you open it. 8. He's always accusing you of hiding his asthma inhaler. 7. Claims he paid you the rent \"a long, long time ago.\" 6. Dances around in nothing but cape and cowboy hat while doing \"Darth Brooks\" routine. 5. For once he could use Force to lift his wet towel off the couch.4. That scary music that plays when he enters a room gets old real fast. 3. You feel like an idiot saying, \"No, Darth isn't here. He's on the ice planet Hoth.\" 2. Not easy cleaning burnt Ewok fur off the barbecue grill.1. Constantly doing his lame James Earl Jones impression.", "What's pink, lives in a sty and drinks blood? \nA hampire.", "Notice to Employees \nSICKNESS\nWe will no longer accept your doctors' statements as proof.\nWe believe if you are able to go to the doctor, you are able to work.\nLEAVE OF ABSENCE FOR SURGERY\nWe are no longer allowing this practice. As long as you are employed here, you will need all of whatever you have and should not consider having anything removed. We hired you as you are, and to have anything removed would certainly make you less than we bargained for. Anyone having operations will be FIRED immediately.\nPREGNANCY\nIn the event of extreme pregnancy, you will be allowed to go to the first aid room when the pains are FIVE MINUTES apart. If it is false labor, you will have to take an hour's leave without pay.\nDEATH\nThis will be accepted as an excuse, BUT we would like two weeks notice.", "My girlfriend's so intense. She woke me up the other night and asked, \"If you could tell exactly when and how you were going to die, would you want to know?\" \"Heck no,\" I said, \"Why?\" \"Doesn't matter, just go back to sleep.\"", "An Illinois man left the snow-filled streets of Chicago for a vacation in Florida. His wife was on a business trip and was planning to meet him there the next day.\nWhen he reached his hotel, he decided to send his wife a quick email. Unable to find the scrap of paper on which he had written her email address, he did his best to type it in from memory.\nUnfortunately, he missed one letter and his note was directed instead to an elderly preacher's wife, whose husband had passed away only the day before. When the grieving widow checked her email, she took one look at the monitor, let out a piercing scream and fell to the floor in a dead faint. At the sound, her family rushed into the room and saw this note on the screen:\nDEAREST WIFE: JUST GOT CHECKED IN. EVERYTHING PREPARED FOR YOUR ARRIVAL TOMORROW.\nP.S. SURE IS HOT DOWN HERE.", "George W. Bush and his driver were going to \n Air Force One and were passing a farm. A pig jumped out in the road \n suddenly. The driver tried to get out of the way, but he hit him. He \n went in the farm to explain what had happened. He came out with a \n beer, a cigar, and a tons of money. Bush saw this and said, \"My God, \n what did you tell them?\" The driver replied, \"I told them that I'm \n George W. Bush's driver and I just killed the pig.\"", "A blonde is watching the news with her husband when the newscaster says, \"Six Brazilian men die in a skydiving accident.\" The blonde starts crying to her husband, sobbing, \"That's horrible!\" Confused, he replies, \"Yes dear, it is sad, but they were skydiving, and there is always that risk involved.\" After a few minutes, the blonde, still sobbing, says, \"How many is a Brazilian?\"", "How did the programmer die in the shower? He read the shampoo bottle instructions: Lather. Rinse. Repeat.", "Teachers\nThree college professors were driving down the highway at a very slow speed. A policeman pulled them over and explained that driving so slowly on the highway could be hazardous. The driver pointed out the sign that read \"20.\" He explained that he was going 20 mph because of the sign. The policeman pointed out that the sign indicated they were driving on Highway 20.\nSomewhat embarrassed the professor apologized and promised to be more observant.\nAs the policeman turn to walk back to his car, he noticed the other two professors on the floor ...looking scared to death! He asked the driver, \"What's wrong with them?\"\nThe driver replied, \"We just turned off Highway 105.\"", "A blonde, a brunette, and a redhead are in a Mexican prison. They committed a crime and have been sentenced to death. The women are instructed to say when they are ready for the firing squad to shoot and kill them. The brunette is called up. She says, \"Ready, aim, tornado!\" Afraid of an approaching funnel cloud, the police quickly turn around and the brunette runs away. Once regrouped, the redhead is summoned. She says, \"Ready, aim, earthquake!\" Fooled again, the police quickly turn around to get cover while the redhead runs away. Then it's the blonde's turn, who says, \"Ready, aim, fire!\"", "An Irishman moves into a tiny hamlet in County Kerry, walks into the pub and promptly orders three beers.\nThe bartender raises his eyebrows, but serves the man three beers, which he drinks quietly at a table, alone.\nAn hour later, the man has finished the three beers and orders three more.\nThis happens yet again.\nThe next evening the man again orders and drinks three beers at a time, several times. Soon the entire town is whispering about the Man Who Orders Three Beers.\nFinally, a week later, the bartender broaches the subject on behalf of the town. \"I don't mean to pry, but folks around here are wondering why you always order three beers?\"\n'Tis odd, isn't it?\" the man replies, \"You see, I have two brothers, and one went to America, and the other to Australia. We promised each other that we would always order an extra two beers whenever we drank as a way of keeping up the family bond.\"\nThe bartender and the whole town was pleased with this answer, and soon the Man Who Orders Three Beers became a local celebrity and source of pride to the hamlet, even to the extent that out-of-towners would come to watch him drink.\nThen, one day, the man comes in and orders only two beers. The bartender pours them with a heavy heart. This continues for the rest of the evening - he orders only two beers. The word flies around town. Prayers are offered for the soul of one of the brothers.\nThe next day, the bartender says to the man, \"Folks around here, me first of all, want to offer condolences to you for the death of your brother. You know-the two beers and all...\"\nThe man ponders this for a moment, then replies, \"You'll be happy to hear that my two brothers are alive and well... It's just that I, myself, have decided to give up drinking for Lent.\"", "Yo mama so fat, Dracula sucked her blood and got diabetes.", "Yo momma is so hairy that you almost died of rug burn at birth!", "Yo momma's like a bungee cord... 100 dollars for 30 seconds and if that rubber breaks, your ass is dead!", "What's the difference between a baby and a pile of sand? You can't pick a pile of sand up with a pitchfork.", "\"Well,\" snarled the tough old sergeant to the bewildered\nprivate. \"I suppose after you get discharged from the Army,\nyou'll just be waiting for me to die so you can come and\nspit on my grave.\"\n\"Not me, Serge!\" the private replied. \"Once I get out of\nthe Army, I'm never going to stand in line again!\""]}
